Configuration.Kanban_for_1C/src/InformationRegisters/канбан_ИсторияСтатусовЗадач/канбан_ИсторияСтатусовЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>канбан_ИсторияСтатусовЗадач</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>DefinedType.канбан_СтатусыЗадачИОшибок</types>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>DefinedType.канбан_Пользователь</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DefinedType.канбан_ЗадачиИОшибки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторЗаписи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Configuration.Kanban_for_1C/src/InformationRegisters/канбан_ИсторияСтатусовЗадач/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Открытый интервал по задаче.
//
// Параметры:
//  Задача - ОпределяемыйТип.канбан_ЗадачиИОшибки
//
// Возвращаемое значение:
//   Неопределено, Структура - результат поиска:
//   * ИдентификаторЗаписи - УникальныйИдентификатор - если запись не найдена
//   * Статус - ОпределяемыйТип.канбан_СтатусыЗадачИОшибок - если запись не найдена
//
Функция ОткрытаяЗаписьПоЗадаче(Задача) Экспорт
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	История.ИдентификаторЗаписи КАК ИдентификаторЗаписи,
		|	История.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.канбан_ИсторияСтатусовЗадач КАК История
		|ГДЕ
		|	История.Задача = &Задача
		|	И История.ДатаОкончания = &ПустаяДата";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	Запрос.УстановитьПараметр("ПустаяДата", ПустаяДатаОкончания());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Результат = Новый Структура;
		Результат.Вставить("ИдентификаторЗаписи", Выборка.ИдентификаторЗаписи);
		Результат.Вставить("Статус", Выборка.Статус);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


// Закрывает интервал по идентификатору записи.
//
// Параметры:
//  Задача - ОпределяемыйТип.канбан_ЗадачиИОшибки
//  ИдентификаторЗаписи - УникальныйИдентификатор
//  Момент - Дата
//
Процедура ЗакрытьИнтервал(Знач Задача, Знач ИдентификаторЗаписи, Момент) Экспорт
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.канбан_ИсторияСтатусовЗадач");
	ЭлементБлокировки.УстановитьЗначение("Задача", Задача);
	ЭлементБлокировки.УстановитьЗначение("ИдентификаторЗаписи", ИдентификаторЗаписи);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка.Заблокировать();
		
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Задача.Установить(Задача);
		НаборЗаписей.Отбор.ИдентификаторЗаписи.Установить(ИдентификаторЗаписи);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		Запись = НаборЗаписей[0];
		Запись.ДатаОкончания = Момент;
		НаборЗаписей.Записать(Истина);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Ошибка при закрытии интервала: %1'"),
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Сообщение.Сообщить();
		
		ЗаписьЖурналаРегистрации(
			"OneKanban: Запись регистра сведений канбан_ИсторияСтатусовЗадач ", 
			УровеньЖурналаРегистрации.Ошибка, , 
			"канбан_ИсторияСтатусовЗадач.ЗакрытьИнтервал", 
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

// Открывает новый интервал в статусе.
//
// Параметры:
//  Задача - ОпределяемыйТип.канбан_ЗадачиИОшибки
//  Статус - ОпределяемыйТип.канбан_СтатусыЗадачИОшибок
//  Исполнитель - ОпределяемыйТип.канбан_Пользователь
//  Момент - Дата
//
Процедура ОткрытьИнтервал(Задача, Статус, Исполнитель, Момент) Экспорт
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.канбан_ИсторияСтатусовЗадач");
	ЭлементБлокировки.УстановитьЗначение("Задача", Задача);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка.Заблокировать();
		
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Задача.Установить(Задача);
		НаборЗаписей.Прочитать();
		
		Для Каждого ТекЗапись Из НаборЗаписей Цикл
			Если ТекЗапись.ДатаОкончания = ПустаяДатаОкончания() Тогда
				Возврат;
			КонецЕсли;
		КонецЦикла;
		
		Запись = НаборЗаписей.Добавить();
		Запись.Задача = Задача;
		Запись.ИдентификаторЗаписи = Новый УникальныйИдентификатор;
		Запись.Статус = Статус;
		Запись.Исполнитель = Исполнитель;
		Запись.ДатаНачала = Момент;
		Запись.ДатаОкончания = ПустаяДатаОкончания();
		НаборЗаписей.Записать(Истина);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Ошибка при открытии интервала: %1'"),
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Сообщение.Сообщить();
		
		ЗаписьЖурналаРегистрации(
			"OneKanban: Запись регистра сведений канбан_ИсторияСтатусовЗадач ", 
			УровеньЖурналаРегистрации.Ошибка, , 
			"канбан_ИсторияСтатусовЗадач.ОткрытьИнтервал", 
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

// Все интервалы истории по задаче или ошибке, по возрастанию даты начала.
//
// Параметры:
//  Задача - ОпределяемыйТип.канбан_ЗадачиИОшибки
//
// Возвращаемое значение:
//  Массив из Структура
//
Функция ЗаписиИсторииПоЗадаче(Задача) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	История.Статус КАК Статус,
		|	История.Исполнитель КАК Исполнитель,
		|	История.ДатаНачала КАК ДатаНачала,
		|	История.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	РегистрСведений.канбан_ИсторияСтатусовЗадач КАК История
		|ГДЕ
		|	История.Задача = &Задача
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаНачала,
		|	ВЫБОР
		|		КОГДА История.ДатаОкончания = &ПустаяДата
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ДатаОкончания";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	Запрос.УстановитьПараметр("ПустаяДата", ПустаяДатаОкончания());
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Удаляет все записи регистра (для тестов и обслуживания).
//
Процедура ОчиститьИсторию() Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	
	Пока НаборЗаписей.Количество() > 0 Цикл
		НаборЗаписей.Удалить(НаборЗаписей.Количество() - 1);
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПустаяДатаОкончания()
	
	Возврат Дата(1, 1, 1);
	
КонецФункции

#КонецОбласти

#КонецЕсли
